docs/modules/publishing/freemacs-markdown.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Markdown Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Markdown Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd9364aa">1. Markdown Mode</a>
<ul>
<li><a href="#org756e37c">1.1. Set Markdown Mode to use Pandoc</a></li>
</ul>
</li>
<li><a href="#org1e8f195">2. End</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgd9364aa" class="outline-2">
<h2 id="orgd9364aa"><span class="section-number-2">1.</span> Markdown Mode</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://jblevins.org/projects/markdown-mode/">Markdown Mode</a> for markdown files. While I prefer Org-mode for rich-text editing in Emacs, Github primarily supports markdown so I want to be able to edit and view these files when needed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">markdown-mode</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:mode</span> <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"\\.</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">(</span><span style="color: #7984D1;">m</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">(</span><span style="color: #7984D1;">ark</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">)</span><span style="color: #7984D1;">?down</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">|</span><span style="color: #7984D1;">md</span><span style="color: #ff2afc; font-weight: bold;">\\</span><span style="color: #ff2afc; font-weight: bold;">)</span><span style="color: #7984D1;">$"</span> . markdown-mode<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span>whicher <span style="color: #7984D1;">"pandoc"</span><span style="color: #ff2afc;">)</span>
  &lt;&lt;markdown_init&gt;&gt;
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">bind-key</span> <span style="color: #7984D1;">"A-b"</span> <span style="color: #a7da1e;">(</span>surround-text-with <span style="color: #7984D1;">"+*"</span><span style="color: #a7da1e;">)</span> markdown-mode-map<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">bind-key</span> <span style="color: #7984D1;">"s-b"</span> <span style="color: #a7da1e;">(</span>surround-text-with <span style="color: #7984D1;">"**"</span><span style="color: #a7da1e;">)</span> markdown-mode-map<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">bind-key</span> <span style="color: #7984D1;">"A-i"</span> <span style="color: #a7da1e;">(</span>surround-text-with <span style="color: #7984D1;">"*"</span><span style="color: #a7da1e;">)</span> markdown-mode-map<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">bind-key</span> <span style="color: #7984D1;">"s-i"</span> <span style="color: #a7da1e;">(</span>surround-text-with <span style="color: #7984D1;">"*"</span><span style="color: #a7da1e;">)</span> markdown-mode-map<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">bind-key</span> <span style="color: #7984D1;">"A-="</span> <span style="color: #a7da1e;">(</span>surround-text-with <span style="color: #7984D1;">"`"</span><span style="color: #a7da1e;">)</span> markdown-mode-map<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">bind-key</span> <span style="color: #7984D1;">"s-="</span> <span style="color: #a7da1e;">(</span>surround-text-with <span style="color: #7984D1;">"`"</span><span style="color: #a7da1e;">)</span> markdown-mode-map<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org756e37c" class="outline-3">
<h3 id="org756e37c"><span class="section-number-3">1.1.</span> Set Markdown Mode to use Pandoc</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Since <a href="https://pandoc.org/">Pandoc</a> can be installed on both Linux and in Windows with Chocolatey, set Markdown Mode to use this as the default markdown command.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> markdown-command '<span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"pandoc"</span> <span style="color: #7984D1;">"--from=markdown"</span> <span style="color: #7984D1;">"--to=html5"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1e8f195" class="outline-2">
<h2 id="org1e8f195"><span class="section-number-2">2.</span> End</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-markdown</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-markdown.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 12:43&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
